package X;

/* loaded from: classes4.dex */
public abstract class A3N {
    public static final String[] A00;

    static {
        String[] strArr = new String[50];
        System.arraycopy(new String[]{"😂", "🤣", "❤️", "😍", "❤", "😘", "🎂", "🙏", "😊", "😁", "🥰", "🎉", "😭", "😅", "💕", "🤔", "👍", "😉", "😢", "♥️", "💔", "🥺", "🙄", "😎", "🤗", "😔", "👏"}, 0, strArr, 0, 27);
        System.arraycopy(new String[]{"👌", "🔥", "😋", "🎁", "🎈", "👉", "💙", "💖", "😆", "💯", "🥳", "🎊", "🌹", "🙂", "💜", "💪", "😥", "🤭", "😜", "✅", "🖤", "😇", "✨"}, 0, strArr, 27, 23);
        A00 = strArr;
    }
}
